# DisplayReferenceCurves Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DividedPath..::..DisplayReferenceCurves Property
DividedPath Class See Also
---
Controls whether the curves in the path are visible
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool DisplayReferenceCurves { get; set; }
```

Visual Basic
---
```text
Public Property DisplayReferenceCurves As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool DisplayReferenceCurves {
	bool get ();
	void set (bool value);
}
```

# Remarks
If true the references that represent the curves will not be hidden. If false the references that represent the curves may be hidden Only references that are curve elements can be hidden If multiple divided paths reference a curve element then the curve element is not hidden unless all divided paths request that it be hidden.
# See Also
DividedPath Class
Autodesk.Revit.DB Namespace